# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P2/4 - P4/16 outputs (Modified for Small Object Detection)
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Assigner Para
assigner_type: 'TaskAlignedAssigner'
topk: 10
alpha: 0.5
beta: 6.0

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone (UNTOUCHED as requested)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4 (Output for Neck)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8 (Output for Neck)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4/16 (Output for Neck)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5/32 (Input for Neck)

# YOLO12n head (Modified for P2-P3-P4 outputs)
head:
  # ---------------- Top-Down Path (FPN) ----------------
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9: Upsample P5
  - [[-1, 6], 1, Concat, [1]] # 10: Cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11: Fused P4 features

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: Upsample P4
  - [[-1, 4], 1, Concat, [1]] # 13: Cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14: Fused P3 features

  # P3 -> P2 (Added for P2 support)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: Upsample P3
  - [[-1, 2], 1, Concat, [1]] # 16: Cat backbone P2 (Layer 2)
  - [-1, 2, A2C2f, [128, False, -1]] # 17: Fused P2 features (High Res)

  # ---------------- Bottom-Up Path (PANet) ----------------
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]] # 18: Downsample P2 (Stride 2)
  - [[-1, 14], 1, Concat, [1]] # 19: Cat Fused P3 (from Layer 14)
  - [-1, 2, A2C2f, [256, False, -1]] # 20: Output P3 (Medium Res)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 21: Downsample P3 (Stride 2)
  - [[-1, 11], 1, Concat, [1]] # 22: Cat Fused P4 (from Layer 11)
  - [-1, 2, C3k2, [512, True]] # 23: Output P4 (Low Res)

  # ---------------- Detection Head ----------------
  # Detect on P2 (17), P3 (20), P4 (23)
  - [[17, 20, 23], 1, Detect, [nc]]